SOAP.postman_collection.json

{
	"info": {
		"_postman_id": "03428037-6a88-459e-89bd-6ba91f97472a",
		"name": "SOAP",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_exporter_id": "32421746"
	},
	"item": [
		{
			"name": "Country Info",
			"item": [
				{
					"name": "Find Capital City",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"type": "text"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <CapitalCity xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n            <sCountryISOCode>USA</sCountryISOCode>\r\n        </CapitalCity>\r\n    </Body>\r\n</Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
							"protocol": "http",
							"host": [
								"webservices",
								"oorsprong",
								"org"
							],
							"path": [
								"websamples.countryinfo",
								"CountryInfoService.wso"
							],
							"query": [
								{
									"key": "WSDL",
									"value": null
								}
							]
						}
					},
					"response": []
				},
				{
					"name": "Find Country Phone Code",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"type": "text"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <CountryIntPhoneCode xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n            <sCountryISOCode>GER</sCountryISOCode>\r\n        </CountryIntPhoneCode>\r\n    </Body>\r\n</Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
							"protocol": "http",
							"host": [
								"webservices",
								"oorsprong",
								"org"
							],
							"path": [
								"websamples.countryinfo",
								"CountryInfoService.wso"
							],
							"query": [
								{
									"key": "WSDL",
									"value": null
								}
							]
						}
					},
					"response": []
				},
				{
					"name": "Find full Country info",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"type": "text"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <FullCountryInfo xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n            <sCountryISOCode>PL</sCountryISOCode>\r\n        </FullCountryInfo>\r\n    </Body>\r\n</Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
							"protocol": "http",
							"host": [
								"webservices",
								"oorsprong",
								"org"
							],
							"path": [
								"websamples.countryinfo",
								"CountryInfoService.wso"
							],
							"query": [
								{
									"key": "WSDL",
									"value": null
								}
							]
						}
					},
					"response": []
				},
				{
					"name": "Language name",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"type": "text"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <LanguageName xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n            <sISOCode>ITA</sISOCode>\r\n        </LanguageName>\r\n    </Body>\r\n</Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "{{WSDL Country Info}}",
							"host": [
								"{{WSDL Country Info}}"
							]
						}
					},
					"response": []
				},
				{
					"name": "New Request",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"type": "text"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <CountryFlag xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n            <sCountryISOCode>BRI</sCountryISOCode>\r\n        </CountryFlag>\r\n    </Body>\r\n</Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "{{WSDL Country Info}}",
							"host": [
								"{{WSDL Country Info}}"
							]
						}
					},
					"response": []
				}
			]
		},
		{
			"name": "Number Conversation",
			"item": [
				{
					"name": "Number to dollars",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"type": "text"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <NumberToDollars xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n            <dNum>846</dNum>\r\n        </NumberToDollars>\r\n    </Body>\r\n</Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "https://www.dataaccess.com/webservicesserver/numberconversion.wso",
							"protocol": "https",
							"host": [
								"www",
								"dataaccess",
								"com"
							],
							"path": [
								"webservicesserver",
								"numberconversion.wso"
							]
						}
					},
					"response": []
				},
				{
					"name": "Number to words",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"type": "text"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n            <ubiNum>10</ubiNum>\r\n        </NumberToWords>\r\n    </Body>\r\n</Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "{{WSDL NumbConvers}}",
							"host": [
								"{{WSDL NumbConvers}}"
							]
						}
					},
					"response": []
				}
			]
		},
		{
			"name": "Wrapper server",
			"item": [
				{
					"name": "Create company",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"type": "text"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <CreateCompany xmlns=\"http://foo.bar/wrappersoapserver\">\r\n            <company_name>QA</company_name>\r\n            <company_type>Conversation</company_type>\r\n            <company_users>123</company_users>\r\n            <email_owner>[string]</email_owner>\r\n        </CreateCompany>\r\n    </Body>\r\n</Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "http://users.bugred.ru/tasks/soap/WrapperSoapServer.php",
							"protocol": "http",
							"host": [
								"users",
								"bugred",
								"ru"
							],
							"path": [
								"tasks",
								"soap",
								"WrapperSoapServer.php"
							]
						}
					},
					"response": []
				},
				{
					"name": "Create user",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"type": "text"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <CreateUser xmlns=\"http://foo.bar/wrappersoapserver\">\r\n            <email>[string]</email>\r\n            <name>[string]</name>\r\n            <tasks>[ArrayOfTasks]</tasks>\r\n            <companies>[ArrayOfCompanies]</companies>\r\n            <hobby>[string]</hobby>\r\n            <adres>[string]</adres>\r\n            <name1>[string]</name1>\r\n            <surname1>[string]</surname1>\r\n            <fathername1>[string]</fathername1>\r\n            <cat>[string]</cat>\r\n            <dog>[string]</dog>\r\n            <parrot>[string]</parrot>\r\n            <cavy>[string]</cavy>\r\n            <hamster>[string]</hamster>\r\n            <squirrel>[string]</squirrel>\r\n            <phone>[string]</phone>\r\n            <inn>[string]</inn>\r\n            <gender>[string]</gender>\r\n            <birthday>[string]</birthday>\r\n            <date_start>[string]</date_start>\r\n        </CreateUser>\r\n    </Body>\r\n</Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "{{WSDL WrapperServer}}",
							"host": [
								"{{WSDL WrapperServer}}"
							]
						}
					},
					"response": []
				},
				{
					"name": "Do register",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"type": "text"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <doRegister xmlns=\"http://foo.bar/wrappersoapserver\">\r\n            <email>req@mail.com</email>\r\n            <name>Max</name>\r\n            <password>123</password>\r\n        </doRegister>\r\n    </Body>\r\n</Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "{{WSDL WrapperServer}}",
							"host": [
								"{{WSDL WrapperServer}}"
							]
						}
					},
					"response": []
				},
				{
					"name": "Do log in",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"type": "text"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <doLogin xmlns=\"http://foo.bar/wrappersoapserver\">\r\n            <email>req@mail.com</email>\r\n            <password>123</password>\r\n        </doLogin>\r\n    </Body>\r\n</Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "{{WSDL WrapperServer}}",
							"host": [
								"{{WSDL WrapperServer}}"
							]
						}
					},
					"response": []
				},
				{
					"name": "Update user one field",
					"request": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"type": "text"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <UpdateUserOneField xmlns=\"http://foo.bar/wrappersoapserver\">\r\n            <email>req@mail.com</email>\r\n            <field>dog</field>\r\n            <value>hobby</value>\r\n        </UpdateUserOneField>\r\n    </Body>\r\n</Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "{{WSDL WrapperServer}}",
							"host": [
								"{{WSDL WrapperServer}}"
							]
						}
					},
					"response": []
				}
			]
		}
	],
	"variable": [
		{
			"key": "WSDL Country Info",
			"value": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL"
		},
		{
			"key": "WSDL NumbConvers",
			"value": "https://www.dataaccess.com/webservicesserver/numberconversion.wso"
		}
	]
}